import { SlashCommandBuilder } from "discord.js";

// 점심메뉴 목록
const MENUS = [
  "김치찌개", "돈까스", "짜장면", "샐러드", "라멘", "햄버거", "피자", "파스타", "비빔밥", "초밥",
  "떡볶이", "치킨", "샌드위치", "부대찌개", "칼국수", "오므라이스", "카레", "스테이크", "샤브샤브", "냉면",
  "순두부찌개", "제육볶음", "갈비탕", "쌀국수", "김밥", "라자냐", "토스트", "파니니", "타코", "부리또",
  "샤오롱바오", "마라탕", "훠궈", "볶음밥", "오징어볶음", "낙지볶음", "삼겹살", "곱창전골", "닭갈비", "양념치킨",
  "간장치킨", "후라이드치킨", "양꼬치", "족발", "보쌈", "순대국밥", "콩나물국밥", "해물파전", "김치전", "감자전",
  "부추전", "된장찌개", "청국장", "갈비찜", "찜닭", "닭볶음탕", "오리주물럭", "오리로스", "삼계탕", "보양식",
  "전복죽", "낙지탕탕이", "해물탕", "조개찜", "굴국밥", "굴전", "굴무침", "굴회무침", "굴튀김", "굴밥",
  "굴라면", "굴칼국수", "리조또", "버거", "핫도그", "프렌치프라이", "치즈스틱", "나쵸", "퀘사디아", "브리또볼",
  "치킨윙", "치킨텐더", "치킨샐러드", "치킨버거", "치킨랩", "치킨파스타", "치킨피자", "치킨라이스", "치킨카레", "치킨스튜",
  "치킨수프", "치킨샌드위치", "치킨버거세트", "치킨랩세트", "치킨파스타세트", "치킨피자세트", "치킨라이스세트", "치킨카레세트", "치킨스튜세트", "치킨수프세트",
  "참깨라면", "오렌지주스", "메밀소바", "등갈비김치찜", "로제파스타", "김치볶음", "소세지빵", "김치", "뿌셔뿌셔(열라면)", "크루아상",
  "딸기우유", "바나나우유", "홍차", "바게트", "소금빵", "계란볶음밥", "짬뽕", "라면", "교촌허니콤보", "아웃백식전빵",
  "낙지볶음밥", "연어초밥", "샤인머스켓", "파이",
];

export default {
  data: new SlashCommandBuilder().setName("점심메뉴").setDescription("오늘의 점심메뉴를 추천해줌!"),

  async execute(interaction) {
    const menu = MENUS[Math.floor(Math.random() * MENUS.length)];
    await interaction.reply(`오늘 점심은 **${menu}** 어때?`);
  },
};


















